offers/testdata/offer-by-id.json

{
  "data": {
    "available": true,
    "hotel": {
      "address": {
        "countryCode": "FR"
      },
      "amenities": [
        "CRIBS_AVAILABLE"
      ],
      "chainCode": "RT",
      "cityCode": "PAR",
      "hotelId": "RTPAR672",
      "name": "ADAGIO PARIS XV",
      "type": "hotel"
    },
    "offers": [
      {
        "boardType": "ROOM_ONLY",
        "checkInDate": "2026-08-22",
        "checkOutDate": "2026-08-25",
        "commission": {
          "description": {
            "text": "Travel agency commission - not applicable"
          }
        },
        "description": {
          "lang": "EN",
          "text": "FLEX - RO B2C"
        },
        "guests": {
          "adults": 2
        },
        "id": "REZ7BSRS3E",
        "isLoyaltyRate": "false",
        "policies": {
          "additionalDetails": [
            {
              "description": [
                {
                  "text": "The credit card used for the reservation will be requested upon your arrival. The name on your ID should be identical to the name on your credit card."
                }
              ]
            }
          ],
          "cancellations": [
            {
              "deadline": "2026-08-21T18:01:00+02:00",
              "description": {
                "text": "No cancellation charge applies prior to 18:00(local time) on the day of arrival. Beyond that time, the first night will be charged."
              },
              "numberOfNights": 1,
              "policyType": "CANCELLATION"
            }
          ],
          "checkInOut": {
            "checkIn": "15:00:00",
            "checkOut": "12:00:00"
          },
          "guarantee": {
            "acceptedPayments": {
              "creditCardPolicies": [
                {
                  "inputParameters": [
                    {
                      "isOptional": "true",
                      "label": "CVV"
                    },
                    {
                      "isOptional": "true",
                      "label": "cardHolderOneName"
                    },
                    {
                      "isOptional": "true",
                      "label": "addressOneLine"
                    },
                    {
                      "isOptional": "true",
                      "label": "postalCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "cityName"
                    },
                    {
                      "isOptional": "true",
                      "label": "stateCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "countryCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "nationality"
                    },
                    {
                      "isOptional": "true",
                      "label": "phone"
                    },
                    {
                      "isOptional": "true",
                      "label": "email"
                    }
                  ],
                  "vendorCode": "AX"
                },
                {
                  "inputParameters": [
                    {
                      "isOptional": "true",
                      "label": "CVV"
                    },
                    {
                      "isOptional": "true",
                      "label": "cardHolderOneName"
                    },
                    {
                      "isOptional": "true",
                      "label": "addressOneLine"
                    },
                    {
                      "isOptional": "true",
                      "label": "postalCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "cityName"
                    },
                    {
                      "isOptional": "true",
                      "label": "stateCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "countryCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "nationality"
                    },
                    {
                      "isOptional": "true",
                      "label": "phone"
                    },
                    {
                      "isOptional": "true",
                      "label": "email"
                    }
                  ],
                  "vendorCode": "CA"
                },
                {
                  "inputParameters": [
                    {
                      "isOptional": "true",
                      "label": "CVV"
                    },
                    {
                      "isOptional": "true",
                      "label": "cardHolderOneName"
                    },
                    {
                      "isOptional": "true",
                      "label": "addressOneLine"
                    },
                    {
                      "isOptional": "true",
                      "label": "postalCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "cityName"
                    },
                    {
                      "isOptional": "true",
                      "label": "stateCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "countryCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "nationality"
                    },
                    {
                      "isOptional": "true",
                      "label": "phone"
                    },
                    {
                      "isOptional": "true",
                      "label": "email"
                    }
                  ],
                  "vendorCode": "DC"
                },
                {
                  "inputParameters": [
                    {
                      "isOptional": "true",
                      "label": "CVV"
                    },
                    {
                      "isOptional": "true",
                      "label": "cardHolderOneName"
                    },
                    {
                      "isOptional": "true",
                      "label": "addressOneLine"
                    },
                    {
                      "isOptional": "true",
                      "label": "postalCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "cityName"
                    },
                    {
                      "isOptional": "true",
                      "label": "stateCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "countryCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "nationality"
                    },
                    {
                      "isOptional": "true",
                      "label": "phone"
                    },
                    {
                      "isOptional": "true",
                      "label": "email"
                    }
                  ],
                  "vendorCode": "EC"
                },
                {
                  "inputParameters": [
                    {
                      "isOptional": "true",
                      "label": "CVV"
                    },
                    {
                      "isOptional": "true",
                      "label": "cardHolderOneName"
                    },
                    {
                      "isOptional": "true",
                      "label": "addressOneLine"
                    },
                    {
                      "isOptional": "true",
                      "label": "postalCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "cityName"
                    },
                    {
                      "isOptional": "true",
                      "label": "stateCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "countryCode"
                    },
                    {
                      "isOptional": "true",
                      "label": "nationality"
                    },
                    {
                      "isOptional": "true",
                      "label": "phone"
                    },
                    {
                      "isOptional": "true",
                      "label": "email"
                    }
                  ],
                  "vendorCode": "IK"
                },
                {
                  "vendorCode": "EE"
                }
              ],
              "creditCards": [
                "AX",
                "CA",
                "DC",
                "EC",
                "IK",
                "EE"
              ],
              "methods": [
                "CREDIT_CARD"
              ]
            },
            "description": {
              "text": "Booking must be guaranteed by providing a credit card."
            }
          },
          "paymentType": "guarantee",
          "refundable": {
            "cancellationRefund": "REFUNDABLE_UP_TO_DEADLINE"
          }
        },
        "price": {
          "base": "300.00",
          "currency": "EUR",
          "taxes": [
            {
              "applicableDate": {
                "end": "2026-08-24",
                "start": "2026-08-22"
              },
              "code": "CITY_TAX",
              "description": "City and local taxes",
              "included": true,
              "pricingFrequency": "PER_NIGHT",
              "pricingMode": "PER_OCCUPANT"
            },
            {
              "applicableDate": {
                "end": "2026-08-24",
                "start": "2026-08-22"
              },
              "code": "COUNTRY_TAX",
              "description": "National taxes on accommodation",
              "included": true,
              "pricingFrequency": "PER_NIGHT",
              "pricingMode": "PER_PRODUCT"
            }
          ],
          "total": "300.00",
          "variations": {
            "changes": [
              {
                "base": "100.00",
                "endDate": "2026-08-25",
                "startDate": "2026-08-22"
              }
            ]
          }
        },
        "rateCode": "1KD",
        "rateFamilyEstimated": {
          "code": "BAR",
          "type": "P"
        },
        "room": {
          "description": {
            "lang": "EN",
            "text": "FLEX - RO B2C\nApartment with 1 bedroom for 4 persons\nMaximum occupancy - 4 people per room\nDaily cleaning, taxes and charges (water, power, heating), except local tourist tax.\nWi-Fi in your room - 220/240 V AC\nIron at reception - Pots/Pans/Dishes\nSafe deposit box in room - Accessible bathroom\nDouble-glazing - Opening windows\nSoundproof - Work desk in all rooms\nBathtub - Hair dryer at reception\nToilets - Audible smoke alarms in rooms\nEmergency info in rooms - Cleaning kit\nCoffee maker - Electric stove\nFridge - Furnished kitchen"
          },
          "type": "P2T",
          "typeEstimated": {
            "bedType": "DOUBLE",
            "beds": 2,
            "category": "ACCESSIBLE_ROOM"
          }
        },
        "roomInformation": {
          "description": "FLEX - RO B2C\nApartment with 1 bedroom for 4 persons\nMaximum occupancy - 4 people per room\nDaily cleaning, taxes and charges (water, power, heating), except local tourist tax.\nWi-Fi in your room - 220/240 V AC\nIron at reception - Pots/Pans/Dishes\nSafe deposit box in room - Accessible bathroom\nDouble-glazing - Opening windows\nSoundproof - Work desk in all rooms\nBathtub - Hair dryer at reception\nToilets - Audible smoke alarms in rooms\nEmergency info in rooms - Cleaning kit\nCoffee maker - Electric stove\nFridge - Furnished kitchen",
          "type": "P2T",
          "typeEstimated": {
            "bedType": "DOUBLE",
            "beds": 2,
            "category": "ACCESSIBLE_ROOM"
          }
        }
      }
    ],
    "type": "hotel-offers"
  },
  "meta": {
    "lang": "en"
  }
}
